Tressilloide/Serra_smart/Kimi_Agent_Smart Greenhouse ESP32 LoRa/camera_ponte/camera_ponte.ino
/*
 * ============================================================================
 *  SERRA SMART — PONTE LoRa <-> WiFi/MQTT  (ESP32 in camera)
 * ============================================================================
 *
 *  Firmware 2.0 — vedi docs/Guida_Serra_Smart.md e docs/PROTOCOLLO.md
 *
 *  ---------------------------------------------------------------------------
 *  COMPITI
 *  ---------------------------------------------------------------------------
 *   - Restare SEMPRE in ascolto LoRa: il nodo trasmette per pochi secondi ogni
 *     15 minuti, non possiamo permetterci di perdere quella finestra
 *   - Pubblicare ogni pacchetto su MQTT e rispondere con un ACK SOLO se la
 *     pubblicazione e' riuscita, cosi' un dato non confermato resta al sicuro
 *     sulla microSD della serra
 *   - Consegnare al nodo i comandi che Home Assistant ha messo in coda,
 *     agganciandoli all'ACK: e' l'unico momento in cui la serra ascolta
 *   - Allegare a ogni ACK l'ora NTP, cosi' il DS1307 della serra si
 *     risincronizza da solo quando la batteria tampone si scarica
 *   - Generare da solo le entita' di Home Assistant, comprese quelle nuove
 *     che non conosce (discovery generica)
 *   - Riconnettersi ad automaticamente a WiFi e MQTT senza mai smettere di
 *     ascoltare la radio
 *
 *  ---------------------------------------------------------------------------
 *  LIBRERIE NECESSARIE
 *  ---------------------------------------------------------------------------
 *    - "LoRa" by Sandeep Mistry
 *    - "PubSubClient" by Nick O'Leary
 *
 *  PRIMA DI COMPILARE: copia secrets.h.example in secrets.h e compilalo.
 *
 *  Scheda: "ESP32 Dev Module"
 * ============================================================================
 */

#include <WiFi.h>
#include <PubSubClient.h>
#include <SPI.h>
#include <LoRa.h>
#include <esp_task_wdt.h>
#include <time.h>

#include "config.h"
#include "secrets.h"
#include "protocollo.h"
#include "discovery.h"
#include "comandi.h"

#if ABILITA_OTA
  #include <ArduinoOTA.h>
#endif

#ifndef ESP_ARDUINO_VERSION_VAL
  #define ESP_ARDUINO_VERSION_VAL(a, b, c) (((a) << 16) | ((b) << 8) | (c))
#endif
#ifndef ESP_ARDUINO_VERSION
  #define ESP_ARDUINO_VERSION ESP_ARDUINO_VERSION_VAL(2, 0, 0)
#endif

// ============================ GLOBALI =======================================

WiFiClient   espClient;
PubSubClient mqtt(espClient);

static uint32_t ultimoTentativoWifi = 0;
static uint32_t ultimoTentativoMqtt = 0;
static uint32_t ultimaDiagnostica   = 0;
static uint32_t ultimaDiscovery     = 0;   // 0 = mai pubblicata
static uint32_t wifiGiuDa           = 0;

static uint32_t riconnessioniWifi   = 0;
static uint32_t riconnessioniMqtt   = 0;
static uint32_t pacchettiRicevuti   = 0;
static uint32_t pacchettiScartati   = 0;
static uint32_t comandiConsegnati   = 0;
static int      ultimoRssi          = 0;
static float    ultimoSnr           = 0.0f;

// Anti-duplicati: il nodo ritrasmette se l'ACK si perde, e senza questo
// controllo il dato finirebbe due volte nello storico e nel totale dell'acqua.
struct ChiaveDedup { uint32_t seq; uint32_t ts; };
static ChiaveDedup dedup[DEDUP_MEMORIA];
static uint8_t     dedupIdx = 0;

// ============================ WATCHDOG ======================================

static void wdtImposta(uint32_t secondi) {
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
  esp_task_wdt_config_t cfg = {};
  cfg.timeout_ms     = secondi * 1000UL;
  cfg.idle_core_mask = 0;
  cfg.trigger_panic  = true;
  // Si prova PRIMA a riconfigurare e solo dopo a inizializzare.
  // Nel core ESP32 3.x il TWDT e' gia' avviato dal framework, quindi init()
  // per primo fallisce sempre e stampa un "E (...) task_wdt: TWDT already
  // initialized" rosso nel log di avvio: sembra un guasto grave e invece e'
  // rumore. Correzione gia' applicata al nodo in watchdog.h; qui il ponte
  // aveva la sua copia locale ed era rimasta indietro.
  esp_err_t e = esp_task_wdt_reconfigure(&cfg);
  if (e == ESP_ERR_INVALID_STATE) e = esp_task_wdt_init(&cfg);
  if (e != ESP_OK) Serial.printf("[WDT] Configurazione fallita (err=%d)\n", (int)e);
#else
  esp_task_wdt_init(secondi, true);
#endif
  // Anche qui: iscrivere un task gia' iscritto stampa un altro errore rosso.
  if (esp_task_wdt_status(NULL) != ESP_OK) esp_task_wdt_add(NULL);
}

// ============================ WIFI ==========================================

/*
 * Scansione delle reti visibili, stampata all'avvio.
 *
 * Serve a scegliere l'access point guardando i numeri invece che a intuito:
 * il segnale va misurato DALLA POSIZIONE DEL PONTE, non da dove sei tu col
 * telefono. Mostra anche se la rete configurata e' effettivamente visibile,
 * il che smaschera subito i due errori piu' comuni: SSID scritto male e rete
 * a 5 GHz, che l'ESP32 non puo' vedere perche' ha solo la radio a 2,4 GHz.
 */
#if SCANSIONE_WIFI_AVVIO
static void wifiScansione() {
  Serial.println(F("[WiFi] Scansione delle reti visibili da qui..."));
  int n = WiFi.scanNetworks();

  if (n <= 0) {
    Serial.println(F("[WiFi] Nessuna rete trovata."));
    return;
  }

  bool trovataLaNostra = false;
  Serial.println(F("       RSSI  canale  SSID"));
  for (int i = 0; i < n && i < 12; i++) {
    bool nostra = (WiFi.SSID(i) == WIFI_SSID);
    if (nostra) trovataLaNostra = true;
    Serial.printf("      %4d  %6d  %s%s\n", WiFi.RSSI(i), WiFi.channel(i),
                  WiFi.SSID(i).c_str(), nostra ? "   <== configurata" : "");
  }

  if (!trovataLaNostra) {
    Serial.printf("[WiFi] ATTENZIONE: \"%s\" non e' fra le reti visibili.\n", WIFI_SSID);
    Serial.println(F("[WiFi] Controlla il nome (occhio a maiuscole e spazi) e"));
    Serial.println(F("[WiFi] ricorda che l'ESP32 vede SOLO i 2,4 GHz, mai i 5 GHz."));
  }
  WiFi.scanDelete();
}
#endif

static void wifiSetup() {
  WiFi.mode(WIFI_STA);
#if SCANSIONE_WIFI_AVVIO
  wifiScansione();
#endif
  WiFi.setAutoReconnect(true);
  WiFi.persistent(true);
  /*
   * Modem-sleep DISATTIVATO, e non e' un dettaglio.
   *
   * Con il modem-sleep la radio WiFi si spegne a intervalli per risparmiare
   * corrente. Su un dispositivo a batteria ha senso; qui il ponte sta attaccato
   * a un alimentatore USB e il risparmio non serve a nulla, mentre il prezzo e'
   * alto: la connessione TCP verso il broker cade in silenzio ogni tanto, e
   * quando il ponte si riconnette il broker pubblica il Last Will della
   * sessione morta. Risultato in Home Assistant: tutte le entita' della serra
   * diventano "non disponibile" per un secondo e poi tornano, a ripetizione.
   */
  WiFi.setSleep(false);
  WiFi.setHostname(OTA_HOSTNAME);
  WiFi.begin(WIFI_SSID, WIFI_PASS);
  Serial.printf("[WiFi] Connessione a %s ...\n", WIFI_SSID);
}

// Non bloccante: il LoRa deve continuare ad ascoltare anche mentre il WiFi
// e' giu'. Nessuna delle funzioni chiamate qui puo' fermare il loop.
static void wifiMantieni() {
  if (WiFi.status() == WL_CONNECTED) {
    if (wifiGiuDa != 0) {
      // Stesso ragionamento del contatore MQTT: all'avvio il WiFi risulta
      // "giu'" per i primi secondi, prima ancora di essersi mai collegato.
      // Quell'aggancio iniziale non e' una riconnessione.
      static bool primoAggancio = true;
      if (primoAggancio) primoAggancio = false;
      else               riconnessioniWifi++;

      int rssi = WiFi.RSSI();
      Serial.printf("[WiFi] Connesso dopo %lu s: %s (RSSI %d dBm) - riconnessioni: %lu\n",
                    (unsigned long)((millis() - wifiGiuDa) / 1000UL),
                    WiFi.localIP().toString().c_str(), rssi,
                    (unsigned long)riconnessioniWifi);

      // Segnalato all'avvio invece di lasciarlo scoprire dai sintomi: sotto
      // questa soglia le cadute di connessione sono attese, non un guasto.
      if (rssi < WIFI_RSSI_DEBOLE)
        Serial.printf("[WiFi] ATTENZIONE: %d dBm e' un segnale debole. Aspettati "
                      "riconnessioni: avvicina il ponte o cambia access point.\n", rssi);

      wifiGiuDa = 0;
    }
    return;
  }

