Tressilloide/Serra_smart/Kimi_Agent_Smart Greenhouse ESP32 LoRa/camera_ponte/camera_ponte.ino
  if (wifiGiuDa == 0) wifiGiuDa = millis();

  /*
   * Riavvio SOLO se il WiFi resta giu' a lungo, non piu' a intervalli fissi.
   * La versione precedente faceva ESP.restart() ogni ora a prescindere:
   * durante i secondi di riavvio la radio non ascolta, e con il nodo che
   * trasmette ogni 15 minuti c'era una probabilita' concreta di perdere
   * proprio quel pacchetto.
   */
  if (millis() - wifiGiuDa > REBOOT_WIFI_DOWN_MS) {
    Serial.println(F("[WiFi] Giu' da troppo tempo: riavvio il ponte."));
    delay(500);
    ESP.restart();
  }

  if (millis() - ultimoTentativoWifi < WIFI_RETRY_MS) return;
  ultimoTentativoWifi = millis();

  Serial.println(F("[WiFi] Disconnesso, ritento..."));
  WiFi.disconnect();
  WiFi.begin(WIFI_SSID, WIFI_PASS);
}

// ============================ ORA (NTP) =====================================

// L'ora del ponte viaggia su ogni ACK ed e' quella con cui la serra corregge
// il proprio DS1307: e' l'unico orologio affidabile del sistema.
static uint32_t oraCorrente() {
  time_t adesso = time(nullptr);
  return (adesso > 1700000000L) ? (uint32_t)adesso : 0;
}

/*
 * Scarto in secondi fra l'ora civile e UTC in questo istante: +7200 con l'ora
 * legale, +3600 con quella solare.
 *
 * Serve perche' time() restituisce UTC e il nodo scrive quel valore tale e
 * quale nel DS1307, per poi confrontare rtc.now().hour() con l'orario
 * programmato da Home Assistant. Senza questo campo "irriga alle 6:00"
 * significava le 6:00 UTC, cioe' le 8:00 italiane d'estate e le 7:00
 * d'inverno: l'acqua arrivava ogni giorno due ore dopo il previsto.
 *
 * Le regole dell'ora legale stanno solo qui, dentro NTP_TZ, ed e' giusto che
 * ci restino: il nodo non ha ne' modo ne' motivo di conoscerle, gli basta il
 * numero che il ponte gli passa a ogni ACK.
 *
 * Il calcolo NON usa tm_gmtoff: e' un'estensione che newlib espone solo con
 * certe combinazioni di macro di visibilita', e una compilazione che oggi
 * funziona potrebbe smettere di farlo al prossimo aggiornamento del core.
 * Confrontare le due rappresentazioni dello stesso istante e' equivalente e
 * non dipende da nulla.
 */
static int32_t offsetFuso() {
  time_t adesso = time(nullptr);
  if (adesso < 1700000000L) return 0;

  struct tm loc, utc;
  localtime_r(&adesso, &loc);
  gmtime_r   (&adesso, &utc);

  int32_t scarto = (int32_t)(loc.tm_hour - utc.tm_hour) * 3600L
                 + (int32_t)(loc.tm_min  - utc.tm_min ) * 60L
                 + (int32_t)(loc.tm_sec  - utc.tm_sec );

  // Le due date possono cadere a cavallo della mezzanotte: in quel caso la
  // sola differenza oraria e' sbagliata di un giorno intero. Lo scarto fra i
  // giorni dell'anno vale +-1 in condizioni normali e +-364/365 a Capodanno,
  // quando l'anno cambia sotto i piedi al confronto.
  int giorni = loc.tm_yday - utc.tm_yday;
  if (giorni ==  1 || giorni < -1) scarto += 86400L;
  if (giorni == -1 || giorni >  1) scarto -= 86400L;

  return scarto;
}

// ============================ MQTT ==========================================

static void mqttCallback(char* topic, byte* payload, unsigned int len) {
  codaMessaggioMqtt(topic, payload, len);
}

static void mqttMantieni() {
  if (WiFi.status() != WL_CONNECTED) return;
  if (mqtt.connected()) return;
  if (millis() - ultimoTentativoMqtt < MQTT_RETRY_MS) return;
  ultimoTentativoMqtt = millis();

  Serial.print(F("[MQTT] Connessione al broker... "));

  // Last Will: se il ponte muore, Home Assistant segna subito le entita'
  // come non disponibili invece di mostrare valori vecchi come se fossero attuali.
  if (mqtt.connect(MQTT_CLIENT_ID, MQTT_USER, MQTT_PASS,
                   TOPIC_PONTE, 1, true, "offline")) {
    // La PRIMA connessione non e' una riconnessione: contarla farebbe
    // sembrare instabile un ponte appena avviato che invece sta benissimo.
    // Questi contatori servono a rispondere a "sta reggendo?", quindi devono
    // partire da zero e restarci finche' non succede davvero qualcosa.
    static bool primaConnessione = true;
    if (primaConnessione) primaConnessione = false;
    else                  riconnessioniMqtt++;

    Serial.printf("OK! (riconnessioni finora: %lu, uptime %lu s)\n",
                  (unsigned long)riconnessioniMqtt,
                  (unsigned long)(millis() / 1000UL));
    mqtt.publish(TOPIC_PONTE, "online", true);
    mqtt.subscribe(TOPIC_CMD_SUB, 1);
    // Subito dopo la sottoscrizione il broker riversa i messaggi ritenuti:
    // i comandi di azione che arrivano adesso sono residui, non richieste.
    codaSegnalaSottoscrizione();

    /*
     * La discovery NON si ripubblica a ogni riconnessione.
     *
     * Sono tredici messaggi ritenuti da ~400 byte: una raffica di 5 KB spinta
     * nel socket alla massima velocita'. Su un WiFi debole basta a far cadere
     * la connessione appena stabilita, il che provoca una riconnessione, che
     * rilancia la raffica. Nel log del ponte si vedeva nitidamente:
     * connessione riuscita, tredici pubblicazioni, caduta dopo cinque secondi,
     * e tutto da capo.
     *
     * Ripubblicare ogni volta era comunque inutile: quei messaggi sono
     * RITENUTI, quindi e' il broker a conservarli. Serve farlo al primo avvio
     * e, per sicurezza, ogni tanto, nel caso il broker sia stato reinstallato.
     */
    uint32_t adessoMs = millis();
    bool servePubblicare = (ultimaDiscovery == 0) ||
                           (adessoMs - ultimaDiscovery > DISCOVERY_RIPUBBLICA_MS);

    if (servePubblicare) {
      discoveryReset();
      if (discoveryPubblicaComandi() && discoveryPubblicaPonte())
        ultimaDiscovery = adessoMs ? adessoMs : 1;   // 0 e' riservato a "mai"
      else
        Serial.println(F("[HA] Discovery interrotta: riprovo alla prossima connessione."));
    } else {
      Serial.printf("[HA] Discovery gia' pubblicata %lu min fa: la salto.\n",
                    (unsigned long)((adessoMs - ultimaDiscovery) / 60000UL));
    }

    codaPubblicaPending();
  } else {
    Serial.printf("fallita (rc=%d), riprovo tra %lu s.\n",
                  mqtt.state(), MQTT_RETRY_MS / 1000UL);
  }
}

// ============================ DEDUP =========================================

static bool giaVisto(uint32_t seq, uint32_t ts) {
  for (uint8_t i = 0; i < DEDUP_MEMORIA; i++)
    if (dedup[i].seq == seq && dedup[i].ts == ts) return true;
  return false;
}

static void ricorda(uint32_t seq, uint32_t ts) {
  dedup[dedupIdx].seq = seq;
  dedup[dedupIdx].ts  = ts;
  dedupIdx = (dedupIdx + 1) % DEDUP_MEMORIA;
}

// ============================ JSON ==========================================

// true se la stringa e' un numero valido per intero (e non, per esempio,
// "2.0.0" o "ok", che nel JSON vanno virgolettati).
static bool eNumerico(const char* s) {
  if (!s || !*s) return false;
  char* fine = nullptr;
  strtod(s, &fine);
  return fine && *fine == '\0';
}

