Tressilloide/Serra_smart/Kimi_Agent_Smart Greenhouse ESP32 LoRa/camera_ponte/camera_ponte.ino
/*
 * Converte il pacchetto in JSON copiando OGNI coppia chiave=valore cosi'
 * com'e'. E' qui che si vede il vantaggio del protocollo v2: il ponte non ha
 * bisogno di sapere quali sensori esistono, quindi aggiungerne uno alla serra
 * non richiede di riflashare anche lui.
 */
static size_t costruisciJson(const PacchettoKV& pkt, char* out, size_t maxOut,
                             int rssi, float snr) {
  /*
   * La coda del JSON viene preparata PRIMA e il suo spazio riservato per tutto
   * il ciclo. Non e' pignoleria: se il buffer si riempisse con i campi, la
   * graffa di chiusura verrebbe troncata e Home Assistant scarterebbe l'intero
   * pacchetto come JSON non valido — tutti i sensori fermi, senza un errore
   * che spieghi perche'. Meglio perdere qualche campo che l'intero messaggio.
   */
  char coda[96];
  int  lCoda = snprintf(coda, sizeof(coda),
                        ",\"rssi\":%d,\"snr\":%.1f,\"ts_ponte\":%lu}",
                        rssi, snr, (unsigned long)oraCorrente());
  if (lCoda < 0 || (size_t)lCoda >= sizeof(coda) || maxOut < (size_t)lCoda + 4) {
    out[0] = '\0';
    return 0;
  }

  size_t pos = 0;
  out[pos++] = '{';
  out[pos]   = '\0';

  bool primo = true, tagliato = false;
  char campo[PROTO_LEN_CHIAVE + PROTO_LEN_VALORE + 8];

  for (uint8_t i = 0; i < pkt.n(); i++) {
    const CampoKV& c = pkt.campo(i);

    int l = eNumerico(c.valore)
          ? snprintf(campo, sizeof(campo), "%s\"%s\":%s",
                     primo ? "" : ",", c.chiave, c.valore)
          : snprintf(campo, sizeof(campo), "%s\"%s\":\"%s\"",
                     primo ? "" : ",", c.chiave, c.valore);
    if (l < 0 || (size_t)l >= sizeof(campo)) continue;   // campo anomalo: saltato

    // Il campo ci sta solo se dopo di lui ci sta ancora tutta la coda.
    if (pos + (size_t)l + (size_t)lCoda + 1 > maxOut) { tagliato = true; break; }

    memcpy(out + pos, campo, (size_t)l);
    pos += (size_t)l;
    out[pos] = '\0';
    primo = false;
  }

  // Se non e' entrato nessun campo va tolta la virgola iniziale della coda,
  // o verrebbe fuori {,"rssi":...} che non e' JSON valido.
  const char* codaDa  = primo ? coda + 1 : coda;
  size_t      codaLen = primo ? (size_t)lCoda - 1 : (size_t)lCoda;

  memcpy(out + pos, codaDa, codaLen);
  pos += codaLen;
  out[pos] = '\0';

  if (tagliato)
    Serial.printf("[MQTT] ATTENZIONE: JSON oltre i %u byte, alcuni campi omessi. "
                  "Alza la dimensione del buffer in gestisciLoRa().\n", (unsigned)maxOut);

  return pos;
}

// ============================ LORA ==========================================

/*
 * Costruisce e invia l'ACK. E' il messaggio piu' importante del sistema:
 *   - conferma al nodo che il dato e' arrivato fino al broker
 *   - porta l'ora corrente, con cui la serra corregge il proprio orologio
 *   - porta l'eventuale comando da eseguire
 * Tutto questo senza un solo pacchetto in piu' rispetto a prima.
 */
static void inviaAck(uint32_t seq, bool allegaComando) {
  char ack[PROTO_MAX_PAYLOAD + 1];

  /*
   * snprintf ritorna quanti caratteri AVREBBE scritto, non quanti ne ha
   * scritti davvero. Accumulando quel valore senza limitarlo, "pos" puo'
   * superare la dimensione del buffer e la sottrazione successiva va in
   * underflow (sono size_t), passando a snprintf una dimensione enorme.
   * Da qui in poi si scriverebbe oltre il buffer. Questa lambda tiene "pos"
   * dentro i limiti qualunque cosa succeda.
   */
  size_t pos = 0;
  auto accoda = [&](const char* fmt, auto... args) {
    if (pos >= sizeof(ack) - 1) return;
    int n = snprintf(ack + pos, sizeof(ack) - pos, fmt, args...);
    if (n < 0) return;
    pos = (size_t)n >= sizeof(ack) - pos ? sizeof(ack) - 1 : pos + (size_t)n;
  };

  accoda("%s;s=%lu", PROTO_PREFIX_ACK, (unsigned long)seq);

  uint32_t adesso = oraCorrente();
  if (adesso > 0) {
    accoda(";now=%lu", (unsigned long)adesso);
    accoda(";tz=%ld",  (long)offsetFuso());
  }

  if (allegaComando && !codaVuota()) {
    ComandoInCoda cmd;
    if (codaEstrai(cmd)) {
      accoda(";c=%lu;o=%s;a=%s", (unsigned long)cmd.id, cmd.opcode, cmd.args);
      comandiConsegnati++;
    }
  }

  LoRa.idle();
  LoRa.beginPacket();
  LoRa.print(ack);
  LoRa.endPacket();
  LoRa.receive();                 // subito di nuovo in ascolto

  Serial.printf("[LoRa] ACK -> %s\n", ack);
}

static void gestisciLoRa() {
  int sz = LoRa.parsePacket();
  if (sz <= 0) return;

  char buf[PROTO_MAX_PAYLOAD + 1];
  int  n = 0;
  while (LoRa.available() && n < (int)sizeof(buf) - 1) buf[n++] = (char)LoRa.read();
  buf[n] = '\0';

  ultimoRssi = LoRa.packetRssi();
  ultimoSnr  = LoRa.packetSnr();
  pacchettiRicevuti++;

  Serial.printf("\n[LoRa] #%lu (RSSI %d dBm, SNR %.1f dB, %d byte): %s\n",
                (unsigned long)pacchettiRicevuti, ultimoRssi, ultimoSnr, n, buf);

  // --- Parsing: v2 (chiave=valore) oppure v1 (CSV posizionale) -------------
  // Il supporto al v1 serve durante l'aggiornamento: sulla microSD del nodo
  // possono esserci record accodati dalla versione precedente del firmware.
  char        prefisso[12] = {0};
  PacchettoKV pkt;
  bool        ok;

  if (protoEV2(buf)) ok = pkt.parse(buf, prefisso, sizeof(prefisso));
  else               ok = protoParseV1(buf, pkt, prefisso, sizeof(prefisso));

  if (!ok || strcmp(prefisso, "GH1") != 0) {
    Serial.println(F("[LoRa] Pacchetto non riconosciuto, ignorato."));
    pacchettiScartati++;
    return;
  }

  uint32_t seq = pkt.valoreU("s", 0);
  uint32_t ts  = pkt.valoreU("t", 0);

  // --- Duplicato? Si conferma comunque, ma non si ripubblica ---------------
  if (giaVisto(seq, ts)) {
    Serial.println(F("[LoRa] Duplicato (ACK perso in precedenza): confermo senza ripubblicare."));
    inviaAck(seq, false);
    return;
  }

  // --- Fresco o storico? ---------------------------------------------------
  // Un record ripescato dal backlog non deve finire su serra/nodo/stato:
  // il nodo trasmette prima il pacchetto attuale e poi la coda arretrata,
  // quindi Home Assistant finirebbe per mostrare come "valore corrente" una
  // lettura di ore prima. ts == 0 significa che il nodo non conosce ancora
  // l'ora: e' un pacchetto fresco, e anzi ha bisogno del "now" nell'ACK.
  uint32_t adesso = oraCorrente();
  bool storico = (ts > 0) && (adesso > 0) && (adesso > ts) &&
                 ((adesso - ts) > SOGLIA_STORICO_SEC);

