Tressilloide/Serra_smart/Kimi_Agent_Smart Greenhouse ESP32 LoRa/camera_ponte/camera_ponte.ino
  const char* topic = storico ? TOPIC_STORICO : TOPIC_STATO;

  /*
   * 900 byte e non 640: un pacchetto LoRa pieno (250 byte, fino a 28 campi)
   * espanso in JSON con virgolette e nomi di chiave puo' superare
   * abbondantemente i 640, e il buffer precedente era piu' piccolo di quello
   * che il protocollo stesso permette di ricevere.
   */
  char json[900];
  costruisciJson(pkt, json, sizeof(json), ultimoRssi, ultimoSnr);
  Serial.printf("[MQTT] %s <- %s\n", topic, json);

  // Retained solo per lo stato attuale: dopo un riavvio di Home Assistant i
  // sensori hanno subito un valore invece di restare vuoti fino al risveglio
  // successivo del nodo (fino a 15 minuti di buco).
  bool pubblicato = mqtt.connected() &&
                    mqtt.publish(topic, (const uint8_t*)json, strlen(json), !storico);

  if (!pubblicato) {
    // Niente ACK: la serra conserva il dato su microSD e lo rimandera'.
    // E' cosi' che la catena "nessun dato perso" resta intatta.
    Serial.println(F("[MQTT] Pubblicazione fallita: NIENTE ACK, la serra terra' il dato su SD."));
    return;
  }

  ricorda(seq, ts);

  // --- Discovery: crea le entita' mancanti, anche per chiavi sconosciute ---
  for (uint8_t i = 0; i < pkt.n(); i++)
    discoveryAssicuraSensore(pkt.campo(i).chiave);

  /*
   * rssi e snr vanno annunciati a parte, ed e' un errore che e' costato due
   * entita' mai nate: non arrivano dal nodo, li aggiunge il ponte in fondo al
   * JSON. Il ciclo qui sopra scorre i campi del PACCHETTO, dove quei due non
   * compaiono, quindi la loro discovery non veniva pubblicata mai — pur
   * essendo regolarmente presenti nella tabella e usati dalle dashboard.
   */
  discoveryAssicuraSensore("rssi");
  discoveryAssicuraSensore("snr");

  // --- Esito di un comando eseguito dal nodo -------------------------------
  if (pkt.ha("res")) {
    const char* det = pkt.valore("det");
    codaPubblicaEsito(pkt.valoreU("res", 0), pkt.valoreU("rc", 0), det ? det : "");
  }

  // --- ACK, con eventuale comando ------------------------------------------
  // Ai record storici NON si allegano comandi: il nodo li invia con una
  // funzione che non li interpreta, quindi il comando andrebbe perso.
  inviaAck(seq, !storico);
}

// ============================ DIAGNOSTICA ===================================

static void pubblicaDiagnostica() {
  if (!mqtt.connected()) return;
  if (millis() - ultimaDiagnostica < DIAG_INTERVALLO_MS) return;
  ultimaDiagnostica = millis();

  // 448 e non 320: con tutti i contatori ai valori massimi il JSON arriva a
  // 284 byte, e 36 byte di margine sono troppo pochi per aggiungerci un altro
  // campo domani senza accorgersi del troncamento.
  char payload[448];
  snprintf(payload, sizeof(payload),
    "{\"uptime\":%lu,\"pkt\":%lu,\"scartati\":%lu,\"cmd_consegnati\":%lu,"
    "\"riconn_wifi\":%lu,\"riconn_mqtt\":%lu,"
    "\"coda\":%u,\"wifi_rssi\":%d,\"heap\":%lu,"
    "\"heap_blocco\":%lu,\"heap_minimo\":%lu,"
    "\"lora_rssi\":%d,\"lora_snr\":%.1f,"
    "\"ip\":\"%s\",\"fw\":\"%s\"}",
    (unsigned long)(millis() / 1000UL),
    (unsigned long)pacchettiRicevuti, (unsigned long)pacchettiScartati,
    (unsigned long)comandiConsegnati,
    (unsigned long)riconnessioniWifi, (unsigned long)riconnessioniMqtt,
    codaConta(),
    WiFi.RSSI(), (unsigned long)ESP.getFreeHeap(),
    /*
     * heap_blocco e heap_minimo servono a rispondere alla domanda che la sola
     * memoria libera NON risolve: la heap si sta frammentando?
     *
     * Un uso intenso di String alloca e libera blocchi di dimensioni sempre
     * diverse, lasciando buchi. Dopo settimane il totale libero puo' restare
     * identico mentre il piu' grande blocco CONTIGUO si rimpicciolisce, finche'
     * un'allocazione fallisce e il dispositivo si riavvia. Guardando solo la
     * memoria libera non si vede arrivare nulla.
     *
     *   heap_blocco  = il piu' grande blocco allocabile in questo momento.
     *                  Se cala giorno dopo giorno mentre "heap" resta stabile,
     *                  quella e' frammentazione.
     *   heap_minimo  = il minimo storico di memoria libera dall'avvio, utile a
     *                  sapere quanto margine c'e' stato davvero nei picchi.
     */
    (unsigned long)ESP.getMaxAllocHeap(),
    (unsigned long)ESP.getMinFreeHeap(),
    ultimoRssi, ultimoSnr,
    WiFi.localIP().toString().c_str(), FW_VERSION_PONTE);

  mqtt.publish(TOPIC_DIAG, (const uint8_t*)payload, strlen(payload), true);
}

// ============================ SETUP / LOOP ==================================

void setup() {
  Serial.begin(115200);
  delay(100);
  Serial.println();
  Serial.println(F("============================================================"));
  Serial.printf ("  PONTE LoRa <-> MQTT - firmware %s\n", FW_VERSION_PONTE);
  Serial.println(F("============================================================"));

  // --- LoRa: gli stessi identici parametri radio del nodo serra ------------
  SPI.begin(LORA_SCK, LORA_MISO, LORA_MOSI);
  LoRa.setPins(LORA_NSS, LORA_RST, LORA_DIO0);

  if (!LoRa.begin(LORA_BAND)) {
    Serial.println(F("[LoRa] ERRORE: modulo non trovato! Riavvio tra 5 s..."));
    Serial.println(F("[LoRa] Controlla cablaggio SPI, NSS=GPIO5, 3,3 V e ANTENNA montata."));
    delay(5000);
    ESP.restart();
  }
  LoRa.setSpreadingFactor(LORA_SF);
  LoRa.setSignalBandwidth(LORA_BW);
  LoRa.setCodingRate4(LORA_CR);
  LoRa.setTxPower(LORA_TX_POWER);
  LoRa.enableCrc();
  LoRa.receive();
  Serial.println(F("[LoRa] In ascolto continuo."));

  wifiSetup();

  configTzTime(NTP_TZ, NTP_SERVER1, NTP_SERVER2);

  mqtt.setServer(MQTT_HOST, MQTT_PORT);
  mqtt.setCallback(mqttCallback);
  // Deve contenere il piu' grande fra: payload di discovery (~400 byte) e
   // JSON di stato (fino a 900), piu' topic e intestazione MQTT.
  mqtt.setBufferSize(1536);
  mqtt.setKeepAlive(30);
  mqtt.setSocketTimeout(5);

  discoveryInit(&mqtt);
  codaInit(&mqtt);

#if ABILITA_OTA
  ArduinoOTA.setHostname(OTA_HOSTNAME);
  ArduinoOTA.setPassword(OTA_PASSWORD);
  ArduinoOTA.onStart([]() {
    Serial.println(F("[OTA] Aggiornamento in corso..."));
    esp_task_wdt_delete(NULL);    // l'upload puo' superare il timeout
  });
  ArduinoOTA.begin();
  Serial.printf("[OTA] Attivo come \"%s\".\n", OTA_HOSTNAME);
#endif

  // Watchdog sul loop. Sostituisce il riavvio orario a tappeto: interviene
  // solo quando il ponte e' davvero bloccato, non ogni ora a prescindere.
  wdtImposta(WDT_LOOP_SEC);
}

void loop() {
  esp_task_wdt_reset();

  // Priorita' assoluta: la radio va servita per prima e a ogni giro.
  // Il nodo trasmette per pochi secondi ogni 15 minuti: quella finestra
  // non si puo' perdere.
  gestisciLoRa();

  wifiMantieni();
  mqttMantieni();
  mqtt.loop();

#if ABILITA_OTA
  ArduinoOTA.handle();
#endif

  pubblicaDiagnostica();

  delay(2);                       // un respiro allo stack WiFi
}
